Vamos a empezar a explorar las bases de datos

In [ ]:
pip install sqldf

In [7]:
#import sqlite3
import sqldf
import pandas as pd
from pylab import*
import numpy as np
import scipy.stats 
from scipy.special import gamma
import seaborn as sns
from scipy.stats import beta
from scipy.stats import spearmanr
import pandas as pd

In [9]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_externa.txt"
bd_ini_externa = pd.read_csv(bd, sep=" ")
bd_ini_externa.head()

    _id_  comp_externo1  comp_externo2  comp_externo3  comp_externo4
0  78213     260.869565      25.854639           56.0         -230.0
1  76457      40.579710       2.872738           62.0         -230.0
2  40666            NaN            NaN          119.0         -230.0
3   8329     349.275362      34.616490           94.0         -230.0
4  68389     276.811594      27.434645          125.0         -230.0

In [19]:
bd_ini_externa.describe()

,_id_,comp_externo1,comp_externo2,comp_externo3,comp_externo4
count,50000.000000,4.783100e+04,44410.000000,49994.000000,5.000000e+04
mean,49568.634780,6.225529e+02,37.622182,66.380146,3.175998e+08
std,28522.021708,1.763822e+04,40.462078,140.022729,1.753622e+09
min,1.000000,0.000000e+00,0.000287,-609.000000,-2.300000e+02
25%,24963.250000,1.304348e+02,11.778225,72.000000,-2.300000e+02
50%,49578.500000,2.637681e+02,23.613904,99.000000,-2.300000e+02
75%,74180.250000,5.434783e+02,49.123815,120.000000,-2.300000e+02
max,98997.000000,2.898551e+06,861.821316,159.000000,1.000000e+10

In [20]:
bd_ini_externa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   _id_           50000 non-null  int64
 1   comp_externo1  47831 non-null  float64
 2   comp_externo2  44410 non-null  float64
 3   comp_externo3  49994 non-null  float64
 4   comp_externo4  50000 non-null  float64
dtypes: float64(4), int64(1)
memory usage: 1.9 MB

In [29]:
query ="""
       select distinct(_id_) as id
       from bd_ini_externa       
       """
len(sqldf.run(query))

50000

In [10]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_interna.csv"
bd_ini_interna = pd.read_csv(bd)
bd_ini_interna.head()

,_id_,fecha_inicio,comp_interno1,comp_interno2,comp_interno3,comp_interno4,categoria1,categoria2,categoria3
0,78213,2020-03-25,0.000000,b'0',11.0,58.0,2.0,9.0,156.0
1,76457,2020-02-13,0.000000,b'1',28.0,45.0,1.0,4.0,173.0
2,40666,2018-01-24,0.000000,b'1',25.0,45.0,1.0,9.0,170.0
3,8329,2016-10-07,0.000000,b'1',14.0,59.0,3.0,3.0,159.0
4,68389,2019-07-30,2026.342452,b'1',1.0,67.0,2.0,9.0,146.0

In [21]:
bd_ini_interna.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   _id_           50000 non-null  int64
 1   fecha_inicio   50000 non-null  object
 2   comp_interno1  50000 non-null  float64
 3   comp_interno2  50000 non-null  object
 4   comp_interno3  50000 non-null  float64
 5   comp_interno4  50000 non-null  float64
 6   categoria1     50000 non-null  float64
 7   categoria2     50000 non-null  float64
 8   categoria3     50000 non-null  float64
dtypes: float64(6), int64(1), object(2)
memory usage: 3.4+ MB

In [30]:
query ="""
       select distinct(_id_) as id
       from bd_ini_interna       
       """
len(sqldf.run(query))

50000

In [11]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_parte1.csv"
bd_ini_parte1 = pd.read_csv(bd)
bd_ini_parte1.head()

    _id_    _id2_  comp_mixto1
0  78213  1798899      0.33522
1  76457  1758511      0.33334
2  40666   935318      0.29186
3   8329   191567      0.29112
4  68389  1572947      0.27318

In [22]:
bd_ini_parte1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   _id_         50000 non-null  int64
 1   _id2_        50000 non-null  int64
 2   comp_mixto1  50000 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 1.1 MB

In [45]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_comportamiento_2.txt"
bd_comportamiento_2 = pd.read_csv(bd,sep=" ",low_memory=False)
bd_comportamiento_2.tail()
#categoria2, o 1 comportamiento de los clientes.

         num_caso      mes_informacion  Tiempo_aparicion
1455531     98990  2021-05-01 00:00:00               1.0
1455532     98992  2021-04-01 00:00:00               0.0
1455533     98992  2021-05-01 00:00:00               1.0
1455534     98997  2021-04-01 00:00:00               0.0
1455535     98997  2021-05-01 00:00:00               1.0

In [23]:
bd_comportamiento_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1455536 entries, 0 to 1455535
Data columns (total 3 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   num_caso          1455536 non-null  int64
 1   mes_informacion   1455536 non-null  object
 2   Tiempo_aparicion  1455536 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 33.3+ MB

In [52]:
query ="""
       select num_caso,count(num_caso),max(Tiempo_aparicion) 
       from bd_comportamiento_2 group by num_caso       
       """
sqldf.run(query).head()

   num_caso  count(num_caso)  max(Tiempo_aparicion)
0         1               62                   61.0
1         7               29                   28.0
2         8               63                   51.0
3         9               15                   14.0
4        10               16                   15.0

In [13]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_comportamiento_3.csv"
bd_comportamiento_3 = pd.read_csv(bd,low_memory=False)
bd_comportamiento_3.head()

   num_caso      mes_informacion  comportamiento_j
0         1  2016-04-01 00:00:00               0.0
1         1  2016-05-01 00:00:00               0.0
2         1  2016-06-01 00:00:00               0.0
3         1  2016-07-01 00:00:00               0.0
4         1  2016-08-01 00:00:00               0.0

In [24]:
bd_comportamiento_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1455536 entries, 0 to 1455535
Data columns (total 3 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   num_caso          1455536 non-null  int64
 1   mes_informacion   1455536 non-null  object
 2   comportamiento_j  1455536 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 33.3+ MB

In [14]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_inversion.txt"
bd_base_inversion= pd.read_csv(bd,sep=" ")
bd_base_inversion.head()

     _id2_  inversion
0  1758511   0.041039
1  1572947  77.422135
2  1051836  90.539953
3  1223255  90.205018
4  1894602   1.071354

In [25]:
bd_base_inversion.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17536 entries, 0 to 17535
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   _id2_      17536 non-null  int64
 1   inversion  17536 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 274.1 KB

In [15]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_parte1.csv"
bd_ini_parte1= pd.read_csv(bd)
bd_ini_parte1.head()

    _id_    _id2_  comp_mixto1
0  78213  1798899      0.33522
1  76457  1758511      0.33334
2  40666   935318      0.29186
3   8329   191567      0.29112
4  68389  1572947      0.27318

In [26]:
bd_ini_parte1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   _id_         50000 non-null  int64
 1   _id2_        50000 non-null  int64
 2   comp_mixto1  50000 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 1.1 MB